### Introduction to Pandas

Importing the Pandas package

In [1]:
import pandas as pd #this will import pandas into your workspace
import numpy as np

**Data Structures in pandas**

There are two basic data structures in pandas: Series and DataFrame

# Series

It is similar to a NumPy 1-dimensional array. In addition to the values that are specified by the programmer, pandas attaches a label to each of the values. If the labels are not provided by the programmer, then pandas assigns labels ( 0 for first element, 1 for second element and so on). A benefit of assigning labels to data values is that it becomes easier to perform manipulations on the dataset as the whole dataset becomes more of a dictionary where each value is associated with a label.

# Lets create our first python series

In [2]:
series1 = pd.Series([10,20,30,40]) #we have used a list to create a series.
print(series1)

0    10
1    20
2    30
3    40
dtype: int64

# Lets know find out the values that are there in the series

In [3]:
series1.values

array([10, 20, 30, 40], dtype=int64)

# Lets find out the index number that are there in the series

In [4]:
series1.index #This would print the starting index and ending index

RangeIndex(start=0, stop=4, step=1)

# If you want to specify custom index values rather than the default ones provided, you can do so using the following command

In [5]:
series2 = pd.Series([10,20,30,40,50], index=['one','two','three','four','five'])
series2

one      10
two      20
three    30
four     40
five     50
dtype: int64

# Lets print the element which is there in the position 2

In [6]:
series2[2]

30

# Lets retrive the element using index number

In [7]:
series2 = pd.Series([10,20,30,40,50], index=['one','two','three','four','five'])
print(series2)
series2['three']

one      10
two      20
three    30
four     40
five     50
dtype: int64

30

# Lets access multiple elements

In [8]:
series2[['one', 'three', 'five']]

one      10
three    30
five     50
dtype: int64

# Lets add "4" to each element of the series (math operations)

In [9]:
series2 + 4

one      14
two      24
three    34
four     44
five     54
dtype: int64

# Lets subset the entire series whose value is greater than 30

In [10]:
series2[series2>30]

four    40
five    50
dtype: int64

#The usual way of creating and initializing dictonary in Python

In [11]:
mydict ={
  "company": "Toyota",
  "model": "Corolla",
  "year": 1994
}
print(mydict)

{'company': 'Toyota', 'model': 'Corolla', 'year': 1994}

# A quick way to initialize a dictionary

In [12]:
myl = [1,2,3,4,5]
myd = dict((x,0) for x in myl) #x represents the key element in the dictionary 
print(myd)
type(myd)

{1: 0, 2: 0, 3: 0, 4: 0, 5: 0}

dict

In [13]:
pd.Series(myd)

1    0
2    0
3    0
4    0
5    0
dtype: int64

# WAP - In class exe :Write code to print a dictionary where the keys are numbers between 1 and 15 (both included) and the values are square of keys.
#Sample Dictionary {1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144, 13: 169, 14: 196, 15: 225}

In [14]:
myl = range(1,16)
myd = dict((x,x*x) for x in myl) #x represents the key element in the dictionary 
print(myd)
type(myd)

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144, 13: 169, 14: 196, 15: 225}

dict

###  Creating a tabular view of data using dictonary and series

In [14]:
myd = {"Orange":1,"Apple":2,"Grapes":3, "Apple":1} # myd is a dictonary type  # we get sorted values and  works only in python 2.7
mytab = pd.Series(myd)
print(mytab) # note that the series data will be sorted 
type(mytab)
mytab[1] #This will print only the values from the series ! 
mytab.index

Orange    1
Apple     1
Grapes    3
dtype: int64

Index(['Orange', 'Apple', 'Grapes'], dtype='object')

# Lets create a dataset for a firm which contains its profits on the yearly basis

In [16]:
years = [90, 91, 92, 93, 94, 95] # Note that the elements in this list match the 
#the keys in the below dictonary
f1 = {90:8, 91:9, 92:7, 93:8, 94:9, 95:11}
firm1 = pd.Series(f1,index=years)
print(firm1)
type(firm1)

90     8
91     9
92     7
93     8
94     9
95    11
dtype: int64

pandas.core.series.Series

# Lets create a another dataset for a new firm called firm2 for the above mentioned years based on the details available below
f2 = {90:14,92:9, 93:13, 94:5}

In [17]:
f2 = {90:14,92:9, 93:13, 94:5}
firm2 = pd.Series(f2,index=years)
firm2

90    14.0
91     NaN
92     9.0
93    13.0
94     5.0
95     NaN
dtype: float64

# Q) How did u get NAN in the above output ?

In [ ]:
becasue 91 and 95 are not in f2

# Note: We always do not get full data from the source or firm. In that case, there will be a missing values where the missing value would be considered as "NaN" which means a "Null value".

# How to find missing values in Pandas?

In [18]:
pd.isnull(firm2)

90    False
91     True
92    False
93    False
94    False
95     True
dtype: bool

# WAP - In class exe :Write code to concatenate following dictionaries to create a new one. 
# Sample Dictionary : dic1={1:10, 2:20} dic2={3:30, 4:40} dic3={5:50,6:60} 
# Expected Result : {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

In [12]:

dic1={1:10,2:20} 
dic2={3:30,4:40} 
dic3={5:50,6:60}
dic4=dict()
dic4.update(dic1)
dic4.update(dic2)
dic4.update(dic3)
print(dic4)

{1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

# Data Frame

DataFrame is a tabular data structure in which data is laid out in rows and column format (similar to a CSV or tables in SQL file), but it can also be used for higher dimensional data sets. The DataFrame object can contain homogenous and heterogenous values, and can be thought of as a logical extension of Series data structures. In contrast to Series, where there is one index, a DataFrame object has one index for column and one index for rows. This allows flexibility in accessing and manipulating data.

# Lets create a Data Frame with multiple columns called Price, Ticker and Company.

In [13]:
data = pd.DataFrame({'price':[95, 25, 85, 41, 78],
                     'ticker':['AXP', 'CSCO', 'DIS', 'MSFT', 'WMT'],
                     'company':['American Express', 'Cisco', 'Walt Disney','Microsoft', 'Walmart']})
data

   price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   MSFT         Microsoft
4     78    WMT           Walmart

#Note: If a column is passed with no values, it will simply have NaN values

# How to access a specefic column from the data frame?

In [20]:
data['company']

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

# How to access a specefic row from the data frame?

In [21]:
data.ix[2] #Will print all the elements of second row

/Users/aniruddhakalbande/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

company    Walt Disney
price               85
ticker             DIS
Name: 2, dtype: object

#Note: ix is the shortform form for index.

# How to add a new column in the data frame?

In [22]:
data['Year'] = 2014
data

            company  price ticker  Year
0  American Express     95    AXP  2014
1             Cisco     25   CSCO  2014
2       Walt Disney     85    DIS  2014
3         Microsoft     41   MSFT  2014
4           Walmart     78    WMT  2014

# WAP - In class exe : Create a new column "prices_discount" in the above data frame where the value should be 10% 
# discounted from the original column "price". This change must be implmented in the 
# same data frame

In [23]:
data['prices_discount'] = data['price']/10
data

            company  price ticker  Year  prices_discount
0  American Express     95    AXP  2014              9.5
1             Cisco     25   CSCO  2014              2.5
2       Walt Disney     85    DIS  2014              8.5
3         Microsoft     41   MSFT  2014              4.1
4           Walmart     78    WMT  2014              7.8

# How to create a column and populate it with missing values(NaN) ?

In [17]:
data['delta_col'] = np.nan
data

   price ticker           company  delta_col
0     95    AXP  American Express        NaN
1     25   CSCO             Cisco        NaN
2     85    DIS       Walt Disney        NaN
3     41   MSFT         Microsoft        NaN
4     78    WMT           Walmart        NaN

# How to delete a column

In [25]:
# del data['name_of_the_col_to_delete']

del data['delta_col']
print(data)

            company  price ticker  Year  prices_discount
0  American Express     95    AXP  2014              9.5
1             Cisco     25   CSCO  2014              2.5
2       Walt Disney     85    DIS  2014              8.5
3         Microsoft     41   MSFT  2014              4.1
4           Walmart     78    WMT  2014              7.8

# How to drop a ROW?

In [26]:
newdata = data.drop(2)
print(newdata)

            company  price ticker  Year  prices_discount
0  American Express     95    AXP  2014              9.5
1             Cisco     25   CSCO  2014              2.5
3         Microsoft     41   MSFT  2014              4.1
4           Walmart     78    WMT  2014              7.8

# How to do a transpose of a dataframe?

In [27]:
dft = data.T #Transpose operation will interchange the rows and columns
dft

                                0      1            2          3        4
company          American Express  Cisco  Walt Disney  Microsoft  Walmart
price                          95     25           85         41       78
ticker                        AXP   CSCO          DIS       MSFT      WMT
Year                         2014   2014         2014       2014     2014
prices_discount               9.5    2.5          8.5        4.1      7.8

You can pass a number of data structures to DataFrame such as a ndarray, lists, dict, Series, and another DataFrame. You can also reindex to confirm to data to a new index. Reindexing is a powerful feature that allows you to access data in a number of different ways, and also to confirm data to some new time series or other index.

# How to reindex the data?

In [19]:
print(data)
new_data = data.reindex(index=[0,2], columns=['company', 'price'])
print(new_data)

   price ticker           company  delta_col
0     95    AXP  American Express        NaN
1     25   CSCO             Cisco        NaN
2     85    DIS       Walt Disney        NaN
3     41   MSFT         Microsoft        NaN
4     78    WMT           Walmart        NaN
            company  price
0  American Express     95
2       Walt Disney     85

# How to fill a missing value with some value in the data frame?

In [29]:
years1 = [90, 91, 92, 93, 94, 95]
f4 = {90:8, 91:9, 92:7, 93:8, 94:9, 95:11}
firm4 = pd.Series(f4,index=years)
f5 = {90:14,91:12, 92:9, 93:13, 94:5, 95:8}
firm5 = pd.Series(f5,index=years)
f6 = {90:8, 91: 9, 92:9,93:10, 94:12, 95: 13}
firm6 = pd.Series(f6,index=years)
df2 = pd.DataFrame(columns=['Firm1','Firm2','Firm3'],index=years1)
df2.Firm1 = firm4
df2.Firm2 = firm5
df2.Firm3 = firm6
df2

    Firm1  Firm2  Firm3
90      8     14      8
91      9     12      9
92      7      9      9
93      8     13     10
94      9      5     12
95     11      8     13

In [30]:
#Note: reindex with only row arguments i.e we want row 88, 89 etc from above df2
reindexdf2 = df2.reindex([88,89,90,91,92,93,94,95,96,97,98], fill_value=0)
reindexdf2

    Firm1  Firm2  Firm3
88      0      0      0
89      0      0      0
90      8     14      8
91      9     12      9
92      7      9      9
93      8     13     10
94      9      5     12
95     11      8     13
96      0      0      0
97      0      0      0
98      0      0      0

# The reason we have zeros is due to the fact that row 88, 89, 86,97 and 97 are 
# not present in our original data frame df2

# How to fill the missing value with the previous value?

In [31]:
reindexdf3 = df2.reindex([88,89,90,91,92,93,94,95,96,97,98], method='ffill')
reindexdf3

    Firm1  Firm2  Firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90    8.0   14.0    8.0
91    9.0   12.0    9.0
92    7.0    9.0    9.0
93    8.0   13.0   10.0
94    9.0    5.0   12.0
95   11.0    8.0   13.0
96   11.0    8.0   13.0
97   11.0    8.0   13.0
98   11.0    8.0   13.0

#Similarly, you have backfill (bfill) method to fill values backwards.

# WAP - In class exe :Create a data frame with three columns named one, two and three and fill the values with random numbers?
    
    Hint: Use numpy to create random numbers.

In [21]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
from numpy.random import randint
c=DataFrame(np.array(randint(15,30,15).reshape(5,3)),columns=['one','two','Three'])
c

   one  two  Three
0   26   29     28
1   22   29     19
2   16   17     28
3   23   29     27
4   26   23     21

# Renaming the columns and rows of an existing data frame

In [32]:
print(" \n Before renaming the above dataframe \n")


print(data) # Let's see the data frame which we have already created 
new_data = data.rename(columns={'ticker' : 'abbriviation'},
index = {0 : 'company1', 1 : 'company2', 2 : 'company3',3:'company4',4:'company5'})

print(" \n After renaming the above dataframe \n")

print(new_data)

 Before renaming the above dataframe

            company  price ticker  Year  prices_discount
0  American Express     95    AXP  2014              9.5
1             Cisco     25   CSCO  2014              2.5
2       Walt Disney     85    DIS  2014              8.5
3         Microsoft     41   MSFT  2014              4.1
4           Walmart     78    WMT  2014              7.8

 After renaming the above dataframe

                   company  price abbriviation  Year  prices_discount
company1  American Express     95          AXP  2014              9.5
company2             Cisco     25         CSCO  2014              2.5
company3       Walt Disney     85          DIS  2014              8.5
company4         Microsoft     41         MSFT  2014              4.1
company5           Walmart     78          WMT  2014              7.8

# Reading from a CSV file and creating a data frame

In [22]:
mycars = pd.read_csv('motor_cars.csv')   # give the file and location inside the brackets
mycars.head()

# https://stat.ethz.ch/R-manual/R-devel/library/datasets/html/mtcars.html
# The above link would help you to understand the data set

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,NaN,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

# Iterating the data frame

In [24]:
# Lets rename the first column (scroll up for the see the default name)
mycars.rename(columns={'Unnamed: 0' : 'car_model'}, inplace=True)

# The below code will print all the column names in the data frame 
for col in mycars:
    print(col)

car_model
mpg
cyl
disp
hp
drat
wt
qsec
vs
am
gear
carb

# understanding iteritems()

In [26]:
headcars = mycars.head()


for key,value in headcars.iteritems():
    print (key,value)

#The iteritems is used to print the column items as key value pairs 
# i.e col name is the key and the data items are the values

car_model 0            Mazda RX4
1        Mazda RX4 Wag
2           Datsun 710
3       Hornet 4 Drive
4    Hornet Sportabout
Name: car_model, dtype: object
mpg 0    21.0
1    21.0
2    22.8
3     NaN
4    18.7
Name: mpg, dtype: float64
cyl 0    6
1    6
2    4
3    6
4    8
Name: cyl, dtype: int64
disp 0    160.0
1    160.0
2    108.0
3    258.0
4    360.0
Name: disp, dtype: float64
hp 0    110
1    110
2     93
3    110
4    175
Name: hp, dtype: int64
drat 0    3.90
1    3.90
2    3.85
3    3.08
4    3.15
Name: drat, dtype: float64
wt 0    2.620
1    2.875
2    2.320
3    3.215
4    3.440
Name: wt, dtype: float64
qsec 0    16.46
1    17.02
2    18.61
3    19.44
4    17.02
Name: qsec, dtype: float64
vs 0    0
1    0
2    1
3    1
4    0
Name: vs, dtype: int64
am 0    1
1    1
2    1
3    0
4    0
Name: am, dtype: int64
gear 0    4
1    4
2    4
3    3
4    3
Name: gear, dtype: int64
carb 0    4
1    4
2    1
3    1
4    2
Name: carb, dtype: int64

# Understanding iterrows()

In [47]:
# All the column elements will be displayed for every row 
for row_index,row in headcars.iterrows():
     print(row_index,row)

(0, car_model    Mazda RX4
mpg                 21
cyl                  6
disp               160
hp                 110
drat               3.9
wt                2.62
qsec             16.46
vs                   0
am                   1
gear                 4
carb                 4
Name: 0, dtype: object)
(1, car_model    Mazda RX4 Wag
mpg                     21
cyl                      6
disp                   160
hp                     110
drat                   3.9
wt                   2.875
qsec                 17.02
vs                       0
am                       1
gear                     4
carb                     4
Name: 1, dtype: object)
(2, car_model    Datsun 710
mpg                22.8
cyl                   4
disp                108
hp                   93
drat               3.85
wt                 2.32
qsec              18.61
vs                    1
am                    1
gear                  4
carb                  1
Name: 2, dtype: object)
(3, car_model    Hornet 4 Drive
mpg                     NaN
cyl                       6
disp                    258
hp                      110
drat                   3.08
wt                    3.215
qsec                  19.44
vs                        1
am                        0
gear                      3
carb                      1
Name: 3, dtype: object)
(4, car_model    Hornet Sportabout
mpg                       18.7
cyl                          8
disp                       360
hp                         175
drat                      3.15
wt                        3.44
qsec                     17.02
vs                           0
am                           0
gear                         3
carb                         2
Name: 4, dtype: object)

# WAP : In class exe: Modify the above program to print the output only for row_index 3 and 4

In [100]:
for row_index,row in headcars.iterrows():
    if row_index ==3 or row_index ==4:
         print(row_index,row)

3 car_model    Hornet 4 Drive
mpg                     NaN
cyl                       6
disp                    258
hp                      110
drat                   3.08
wt                    3.215
qsec                  19.44
vs                        1
am                        0
gear                      3
carb                      1
Name: 3, dtype: object
4 car_model    Hornet Sportabout
mpg                       18.7
cyl                          8
disp                       360
hp                         175
drat                      3.15
wt                        3.44
qsec                     17.02
vs                           0
am                           0
gear                         3
carb                         2
Name: 4, dtype: object

# Sorting

In [37]:
sorted_cars=headcars.sort_index(ascending=False)
print(sorted_cars)

#Note:Sort index will sort the data frame based on the row index. Remove the 
# ascending = False option and observe the output

           car_model   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  \
4  Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3
3     Hornet 4 Drive   NaN    6  258.0  110  3.08  3.215  19.44   1   0     3
2         Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4
1      Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4
0          Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4

   carb
4     2
3     1
2     1
1     4
0     4

# Sorting based on column values

In [38]:
# We are going to sort the data frame by the milage (mpg) column 
topmpg = mycars.sort_values(by='mpg') 
topmpg

# Note that the row index is not in sorted order when we sort based on a column value 
# We can now use sort_index() to sort the data frame in the ascending order of row index

,car_model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
13,Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
22,AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
21,Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
11,Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
24,Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
3,Hornet 4 Drive,NaN,6,258.0,110,3.08,3.215,19.44,1,0,3,1
12,Merc 450SL,NaN,8,275.8,180,3.07,3.730,17.60,0,0,3,3
31,Volvo 142E,NaN,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [ ]:
topmpg = mycars.sort_values(by='mpg') 
topmpg

# WAP : (In class exe) To pick only the top 10 cars with maximum milage

In [101]:
topmpg = mycars.sort_values(by='disp') 
topmpg.head(10)

,car_model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
31,Volvo 142E,NaN,4,121.0,109,4.11,2.780,18.60,1,1,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2

# Indexing and selecting data      - used in Linear Regression

In [39]:

modelnames = mycars.loc[:,'car_model'] # pick all the rows of the column "car_model"
print(modelnames.head())

print("\n \n")

name_mpg = mycars.loc[:,['car_model','mpg']] # We can specify more than one column 
print(name_mpg.head())

print("\n \n")


rows_name_mpg = mycars.loc[[0,1,2],['car_model','mpg']]
print(rows_name_mpg)

# The above command mycars.loc[[0,1,2],['car_model','mpg']] can also be executed like below eg 
# mycars.loc[[0:2],['car_model','mpg']]

0            Mazda RX4
1        Mazda RX4 Wag
2           Datsun 710
3       Hornet 4 Drive
4    Hornet Sportabout
Name: car_model, dtype: object



           car_model   mpg
0          Mazda RX4  21.0
1      Mazda RX4 Wag  21.0
2         Datsun 710  22.8
3     Hornet 4 Drive   NaN
4  Hornet Sportabout  18.7



       car_model   mpg
0      Mazda RX4  21.0
1  Mazda RX4 Wag  21.0
2     Datsun 710  22.8

# Indexing the data frames using iloc()

In [40]:
print(mycars.iloc[[1,2], [3,4]])                                 
      # Pick row 1&2 elements for column 3 and 4

    disp   hp
1  160.0  110
2  108.0   93

# Try these options in iloc()

In [41]:
print(mycars.iloc[1:3, :]) 
# Pick all cols for row 1 to 3 

print(mycars.iloc[:, 1:3]) 
# pick all rows of col 1 to 3

       car_model   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  \
1  Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4
2     Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4

   carb
1     4
2     1
     mpg  cyl
0   21.0    6
1   21.0    6
2   22.8    4
3    NaN    6
4   18.7    8
5   18.1    6
6   14.3    8
7   24.4    4
8   22.8    4
9   19.2    6
10  17.8    6
11  16.4    8
12   NaN    8
13  15.2    8
14  10.4    8
15  10.4    8
16  14.7    8
17  32.4    4
18  30.4    4
19  33.9    4
20  21.5    4
21  15.5    8
22  15.2    8
23  13.3    8
24  19.2    8
25  27.3    4
26  26.0    4
27  30.4    4
28  15.8    8
29  19.7    6
30  15.0    8
31   NaN    4

# Understanding .ix() function for slicing a data frame

In [42]:
print(mycars.ix[:3])
# The above is used to print the

        car_model   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  \
0       Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4
1   Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4
2      Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4
3  Hornet 4 Drive   NaN    6  258.0  110  3.08  3.215  19.44   1   0     3

   carb
0     4
1     4
2     1
3     1

/Users/aniruddhakalbande/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

# Try running the below piece of code to understand different ways of using .ix() function

In [43]:
print(mycars.ix[:,'mpg'])

0     21.0
1     21.0
2     22.8
3      NaN
4     18.7
5     18.1
6     14.3
7     24.4
8     22.8
9     19.2
10    17.8
11    16.4
12     NaN
13    15.2
14    10.4
15    10.4
16    14.7
17    32.4
18    30.4
19    33.9
20    21.5
21    15.5
22    15.2
23    13.3
24    19.2
25    27.3
26    26.0
27    30.4
28    15.8
29    19.7
30    15.0
31     NaN
Name: mpg, dtype: float64

/Users/aniruddhakalbande/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

# Take home exercise 
# Description about the "mtcars" data set can be found in the below link 

https://stat.ethz.ch/R-manual/R-devel/library/datasets/html/mtcars.html
 

Create a new data frame from the "mtcars" provided to you as csv file. 
The new data frame must have the following colunms 



Col 1 : 
Cubic capacity in cubic centemeters and this must be a whole number ( with floor and ceiling corrected based on > or < 0.5 respectively Hint : Use the round() function) the existing data frame contains this data in cubic inches (engine diplacement column)

1 cubic inch = 16.387 cubic centimeteres 

  
Col 2 : Power is to Weight Ratio, weight of the car is provided in units per 1000 LBS, you would need to convert it to LB's first and then calculate the power/weight ratio. In case if this is in too low a decimal number, then you will have to represent it appropriately by convering it to a whole number which is readable. 

 
Col 3 : Milage (Note: The places where NaN is marked have to be ignored for calculation and should be 
               present as NaN in the final output)


The final output in the data frame is must be sorted based on the cc of the 
engine. The final output must contain the rows of only those car models 
where is engine capacity is greater than 2500 (where cc is converted from 
                                              cubic inches to cubic centimeters)    

The code should be well organized into user defined functions wherever 
applicable. The car names columns must be retained as the original data frame.

In [102]:
import pandas as pd

data= pd.read_csv('motor_cars.csv')
data.rename(columns={'Unnamed: 0' : 'car_names'}, inplace=True)
data['CC']=round(data['disp']*16.387)
data['PtoW']=round(data['hp']/(data['wt']*1000),5)
data2=data.loc[:,['car_names','CC','PtoW','mpg']]
data2=data2.sort_values(by='CC')
data2=data2[data2['CC']>2500]

data2.head()

        car_names      CC     PtoW   mpg
0       Mazda RX4  2622.0  0.04198  21.0
1   Mazda RX4 Wag  2622.0  0.03826  21.0
10      Merc 280C  2746.0  0.03576  17.8
9        Merc 280  2746.0  0.03576  19.2
5         Valiant  3687.0  0.03035  18.1